app/controllers/blogs_controller.rb

SELECT `blogs`.* FROM `blogs`
---
  def index
    @blogs = Blog.all

SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`id` = ? LIMIT 1  [["id", "1"]]
---
  def show
    @blog = Blog.find(params[:id])

INSERT INTO `blogs` (`blog_author`, `blog_title`, `blog_url`, `created_at`, `updated_at`) VALUES (?, ?, ?, ?, ?)
SELECT `requests`.* FROM `requests` WHERE `requests`.`blog_url` = 'http://mansiwatve.blogspot.com' LIMIT 1
DELETE FROM `requests` WHERE `requests`.`id` = ?  [["id", 1]]
---
  def create
    @blog = Blog.new(params[:blog])
    respond_to do |format|
      if @blog.save
        request = Request.find_by_blog_url(@blog.blog_url)
        request.destroy if request

SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`id` = ? LIMIT 1  [["id", "4"]]
DELETE FROM `blogs` WHERE `blogs`.`id` = ?  [["id", 4]]
DELETE FROM `posts` WHERE (id in (NULL))
SELECT `posts`.* FROM `posts` WHERE `posts`.`blog_id` = 4
---
  def destroy
    @blog = Blog.find(params[:id])
    Post.delete_all(["id in (?)",@blog.posts.collect(&:id)])

SELECT `blogs`.* FROM `blogs`
SELECT COUNT(*) FROM `posts`
SELECT `posts`.* FROM `posts` ORDER BY post_date DESC LIMIT 5 OFFSET 0
---
  def read_blogs
    @blogs = Blog.all
    @posts = Post.order("post_date DESC").page(params[:page])